In [ ]:
# 실습 Series and DF  *** 25.03.04 Python 사용

In [3]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp313-cp313-win_amd64.whl.metadata (19 kB)
Collecting numpy>=1.26.0 (from pandas)
  Downloading numpy-2.2.3-cp313-cp313-win_amd64.whl.metadata (60 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\syohn\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\syohn\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp313-cp313-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ----------------------- ---------------- 6.8/11.5 MB 33.6 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 29.7 MB/s eta 0:00:00
Downloading numpy-2.2.3-cp313-cp313-win_amd64.whl (12.6 MB)
   ---------------------------------------- 0.0/12.6 MB ? eta -:--:--
   ---------------------------- ----------- 8.9/12.6 MB 43.7 MB/s eta 0:00:01
   ---------------------------------------- 12.6/12.6 MB 32.7 MB/s eta 0:00:00
Downloading pytz-2025.1-py2.py3-none-any.whl (507 kB)
Downloading tzdata-2025.1-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.2.3 pandas-2.2.3 pytz-2025.1 tzdata-2025.1

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [23]:
import pandas as pd

In [24]:
#참고 링크 

# Pandas documentation
# https://pandas.pydata.org/docs/index.html

# list, tuple, dictionary, set 
# URL=https://cording-artist.tistory.com/124

In [25]:
# Series = Vector

In [26]:
pd.Series?

Init signature:
pd.Series(
    data=None,
    index=None,
    dtype: 'Dtype | None' = None,
    name=None,
    copy: 'bool | None' = None,
    fastpath: 'bool | lib.NoDefault' = <no_default>,
) -> 'None'
Docstring:
One-dimensional ndarray with axis labels (including time series).

Labels need not be unique but must be a hashable type. The object
supports both integer- and label-based indexing and provides a host of
methods for performing operations involving the index. Statistical
methods from ndarray have been overridden to automatically exclude
missing data (currently represented as NaN).

Operations between Series (+, -, /, \*, \*\*) align values based on their
associated index values-- they need not be the same length. The result
index will be the sorted union of the two indexes.

Parameters
----------
data : array-like, Iterable, dict, or scalar value
    Contains data stored in Series. If data is a dict, argument order is
    maintained.
index : array-like or Index (1d)
    Values must be hashable and have the same length as `data`.
    Non-unique index values are allowed. Will default to
    RangeIndex (0, 1, 2, ..., n) if not provided. If data is dict-like
    and index is None, then the keys in the data are used as the index. If the
    index is not None, the resulting Series is reindexed with the index values.
dtype : str, numpy.dtype, or ExtensionDtype, optional
    Data type for the output Series. If not specified, this will be
    inferred from `data`.
    See the :ref:`user guide <basics.dtypes>` for more usages.
name : Hashable, default None
    The name to give to the Series.
copy : bool, default False
    Copy input data. Only affects Series or 1d ndarray input. See examples.

Notes
-----
Please reference the :ref:`User Guide <basics.series>` for more information.

Examples
--------
Constructing Series from a dictionary with an Index specified

>>> d = {'a': 1, 'b': 2, 'c': 3}
>>> ser = pd.Series(data=d, index=['a', 'b', 'c'])
>>> ser
a   1
b   2
c   3
dtype: int64

The keys of the dictionary match with the Index values, hence the Index
values have no effect.

>>> d = {'a': 1, 'b': 2, 'c': 3}
>>> ser = pd.Series(data=d, index=['x', 'y', 'z'])
>>> ser
x   NaN
y   NaN
z   NaN
dtype: float64

Note that the Index is first build with the keys from the dictionary.
After this the Series is reindexed with the given Index values, hence we
get all NaN as a result.

Constructing Series from a list with `copy=False`.

>>> r = [1, 2]
>>> ser = pd.Series(r, copy=False)
>>> ser.iloc[0] = 999
>>> r
[1, 2]
>>> ser
0    999
1      2
dtype: int64

Due to input data type the Series has a `copy` of
the original data even though `copy=False`, so
the data is unchanged.

Constructing Series from a 1d ndarray with `copy=False`.

>>> r = np.array([1, 2])
>>> ser = pd.Series(r, copy=False)
>>> ser.iloc[0] = 999
>>> r
array([999,   2])
>>> ser
0    999
1      2
dtype: int64

Due to input data type the Series has a `view` on
the original data, so
the data is changed as well.
File:           c:\users\syohn\appdata\local\programs\python\python313\lib\site-packages\pandas\core\series.py
Type:           type
Subclasses:     SubclassedSeries

In [13]:
# Series 생성
s=pd.Series(["Kor", "Jap", "Usa", "Ger"])

In [14]:
s

0    Kor
1    Jap
2    Usa
3    Ger
dtype: object

In [15]:
type(s)

pandas.core.series.Series

In [16]:
len(s)

4

In [17]:
s[1]

'Jap'

In [18]:
# custom index
s=pd.Series(["Kor", "Jap", "Usa", "Ger"], index=["a", "b", "c", "d"])

In [19]:
s

a    Kor
b    Jap
c    Usa
d    Ger
dtype: object

In [20]:
s["a"]

'Kor'

In [21]:
country=["Kor", "Jap", "Usa", "Ger"] # list
cost =[1000, 2000, 3000, 4000]

In [22]:
sales=pd.Series(cost, index = country)

In [15]:
sales

Kor    1000
Jap    2000
Usa    3000
Ger    4000
dtype: int64

In [16]:
country=("Kor", "Jap", "Usa", "Ger") # tuple
cost =(1000, 2000, 3000, 4000)

In [17]:
sales=pd.Series(cost, index = country)

In [18]:
sales

Kor    1000
Jap    2000
Usa    3000
Ger    4000
dtype: int64

In [28]:
data = {"Kor":1000, "Jap":2000, "Usa":3000, "Ger":4000} #dictionary

In [29]:
data

{'Kor': 1000, 'Jap': 2000, 'Usa': 3000, 'Ger': 4000}

In [30]:
sales=pd.Series(data, index = country)

In [32]:
sales

Kor    1000
Jap    2000
Usa    3000
Ger    4000
dtype: int64

In [ ]:
# DataFrame = Table, 행렬 과 다른 점은 type 이 다른 열을 포함.

In [22]:
pd.DataFrame?

Init signature:
pd.DataFrame(
    data=None,
    index: 'Axes | None' = None,
    columns: 'Axes | None' = None,
    dtype: 'Dtype | None' = None,
    copy: 'bool | None' = None,
) -> 'None'
Docstring:
Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns).
Arithmetic operations align on both row and column labels. Can be
thought of as a dict-like container for Series objects. The primary
pandas data structure.

Parameters
----------
data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame
    Dict can contain Series, arrays, constants, dataclass or list-like objects. If
    data is a dict, column order follows insertion-order. If a dict contains Series
    which have an index defined, it is aligned by its index. This alignment also
    occurs if data is a Series or a DataFrame itself. Alignment is done on
    Series/DataFrame inputs.

    If data is a list of dicts, column order follows insertion-order.

index : Index or array-like
    Index to use for resulting frame. Will default to RangeIndex if
    no indexing information part of input data and no index provided.
columns : Index or array-like
    Column labels to use for resulting frame when data does not have them,
    defaulting to RangeIndex(0, 1, 2, ..., n). If data contains column labels,
    will perform column selection instead.
dtype : dtype, default None
    Data type to force. Only a single dtype is allowed. If None, infer.
copy : bool or None, default None
    Copy data from inputs.
    For dict data, the default of None behaves like ``copy=True``.  For DataFrame
    or 2d ndarray input, the default of None behaves like ``copy=False``.
    If data is a dict containing one or more Series (possibly of different dtypes),
    ``copy=False`` will ensure that these inputs are not copied.

    .. versionchanged:: 1.3.0

See Also
--------
DataFrame.from_records : Constructor from tuples, also record arrays.
DataFrame.from_dict : From dicts of Series, arrays, or dicts.
read_csv : Read a comma-separated values (csv) file into DataFrame.
read_table : Read general delimited file into DataFrame.
read_clipboard : Read text from clipboard into DataFrame.

Notes
-----
Please reference the :ref:`User Guide <basics.dataframe>` for more information.

Examples
--------
Constructing DataFrame from a dictionary.

>>> d = {'col1': [1, 2], 'col2': [3, 4]}
>>> df = pd.DataFrame(data=d)
>>> df
   col1  col2
0     1     3
1     2     4

Notice that the inferred dtype is int64.

>>> df.dtypes
col1    int64
col2    int64
dtype: object

To enforce a single dtype:

>>> df = pd.DataFrame(data=d, dtype=np.int8)
>>> df.dtypes
col1    int8
col2    int8
dtype: object

Constructing DataFrame from a dictionary including Series:

>>> d = {'col1': [0, 1, 2, 3], 'col2': pd.Series([2, 3], index=[2, 3])}
>>> pd.DataFrame(data=d, index=[0, 1, 2, 3])
   col1  col2
0     0   NaN
1     1   NaN
2     2   2.0
3     3   3.0

Constructing DataFrame from numpy ndarray:

>>> df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
...                    columns=['a', 'b', 'c'])
>>> df2
   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

Constructing DataFrame from a numpy ndarray that has labeled columns:

>>> data = np.array([(1, 2, 3), (4, 5, 6), (7, 8, 9)],
...                 dtype=[("a", "i4"), ("b", "i4"), ("c", "i4")])
>>> df3 = pd.DataFrame(data, columns=['c', 'a'])
...
>>> df3
   c  a
0  3  1
1  6  4
2  9  7

Constructing DataFrame from dataclass:

>>> from dataclasses import make_dataclass
>>> Point = make_dataclass("Point", [("x", int), ("y", int)])
>>> pd.DataFrame([Point(0, 0), Point(0, 3), Point(2, 3)])
   x  y
0  0  0
1  0  3
2  2  3

Constructing DataFrame from Series/DataFrame:

>>> ser = pd.Series([1, 2, 3], index=["a", "b", "c"])
>>> df = pd.DataFrame(data=ser, index=["a", "c"])
>>> df
   0
a  1
c  3

>>> df1 = pd.DataFrame([1, 2, 3], index=["a", "b", "c"], columns=["x"])
>>> df2 = pd.DataFrame(data=df1, index=["a", "c"])
>>> df2
   x
a  1
c  3
File:           c:\programdata\anaconda3\lib\site-packages\pandas\core\frame.py
Type:           type
Subclasses:     SubclassedDataFrame

In [21]:
EmployeeData = {
    'ID' : [101, 102, 103], 
    'name' : ['Daniel', 'Christine', 'Butler'],
    'age' : [34, 32, 40],
    'city' : ['New York', 'White Planes', 'Chicago']
}

In [24]:
# Dictionary of lists
EmployeeData = {
    'ID' : [101, 102, 103], 
    'name' : ['Daniel', 'Christine', 'Butler'],
    'age' : [34, 32, 40],
    'city' : ['New York', 'White Plains', 'Chicago']
}
# DF
EmpDB = pd.DataFrame(EmployeeData)
EmpDB

    ID       name  age          city
0  101     Daniel   34      New York
1  102  Christine   32  White Plains
2  103     Butler   40       Chicago

In [25]:
EmpDB.loc[1,:]

ID               102
name       Christine
age               32
city    White Plains
Name: 1, dtype: object

In [26]:
EmpDB.loc[1:2,:]

    ID       name  age          city
1  102  Christine   32  White Plains
2  103     Butler   40       Chicago

In [27]:
EmpDB.iloc[-3,:]

ID           101
name      Daniel
age           34
city    New York
Name: 0, dtype: object

In [28]:
EmpDB.iloc[[2, 1],:]

    ID       name  age          city
2  103     Butler   40       Chicago
1  102  Christine   32  White Plains

In [29]:
EmpDB.loc[:, 'name']

0       Daniel
1    Christine
2       Butler
Name: name, dtype: object

In [30]:
EmpDB.loc[1:2, ['name', 'age']]

        name  age
1  Christine   32
2     Butler   40

In [31]:
EmpDB = pd.DataFrame(EmployeeData, index =['a', 'b', 'c'])
EmpDB

    ID       name  age          city
a  101     Daniel   34      New York
b  102  Christine   32  White Plains
c  103     Butler   40       Chicago

In [ ]:
# Indexing

In [32]:
EmpDB.loc['a']

ID           101
name      Daniel
age           34
city    New York
Name: a, dtype: object

In [33]:
EmpDB.loc['a':'c']

    ID       name  age          city
a  101     Daniel   34      New York
b  102  Christine   32  White Plains
c  103     Butler   40       Chicago

In [34]:
EmpDB.loc['a':'c', "age":]

   age          city
a   34      New York
b   32  White Plains
c   40       Chicago

In [35]:
EmpDB.loc['a':'c',:"city"]

    ID       name  age          city
a  101     Daniel   34      New York
b  102  Christine   32  White Plains
c  103     Butler   40       Chicago

In [36]:
EmpDB.loc['c',:"city"]

ID          103
name     Butler
age          40
city    Chicago
Name: c, dtype: object

In [37]:
EmpDB.iloc[1]

ID               102
name       Christine
age               32
city    White Plains
Name: b, dtype: object

In [38]:
# Empty DF and add rows and columns
# Note: append method is deprecated from pandas 2.0
df = pd.DataFrame()

In [39]:
type(df)

pandas.core.frame.DataFrame

In [40]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [41]:
df

Empty DataFrame
Columns: []
Index: []

In [42]:
ColumnData = ['ID', 'Emp', 'Salary', 'Exp']
df1 = pd.DataFrame(columns = ColumnData)
df1

Empty DataFrame
Columns: [ID, Emp, Salary, Exp]
Index: []

In [23]:
pd.concat?

Signature:
pd.concat(
    objs: 'Iterable[Series | DataFrame] | Mapping[HashableT, Series | DataFrame]',
    *,
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys=None,
    levels=None,
    names: 'list[HashableT] | None' = None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool | None' = None,
) -> 'DataFrame | Series'
Docstring:
Concatenate pandas objects along a particular axis.

Allows optional set logic along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

It is not recommended to build DataFrames by adding single rows in a
for loop. Build a list of rows and make a DataFrame in a single concat.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']

Append a single row to the end of a ``DataFrame`` object.

>>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
>>> df7
    a   b
0   1   2
>>> new_row = pd.Series({'a': 3, 'b': 4})
>>> new_row
a    3
b    4
dtype: int64
>>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
    a   b
0   1   2
1   3   4
File:      c:\programdata\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [43]:
type(df1)

pandas.core.frame.DataFrame

In [44]:
new_row = {'ID': 101, 'Emp':"Mark", 'Salary':2000, 'Exp':3}
df2 = pd.concat([df1, pd.DataFrame([new_row])], ignore_index=True)
df2

    ID   Emp Salary Exp
0  101  Mark   2000   3

In [45]:
# !!! Wrong 
new_row = { 101, "Mark", 2000, 3}
df3= pd.concat([df1, pd.DataFrame([new_row])], ignore_index=True)
df3

    ID  Emp Salary  Exp     0    1      2       3
0  NaN  NaN    NaN  NaN  Mark  3.0  101.0  2000.0

In [46]:
# concat two DFs verticaly
EmployeeData_top= {
    'ID' : [101, 102, 103], 
    'name' : ['Daniel', 'Christine', 'Butler'],
    'age' : [34, 32, 40],
    'city' : ['New York', 'White Plains', 'Chicago']
}
# DF
EmpDB_top = pd.DataFrame(EmployeeData_top, index=[1, 2, 3])
EmpDB_top

EmployeeData_bottom= {
    'ID' : [201, 202, 203], 
    'name' : ['Charlie', 'Cathy', 'Jack'],
    'age' : [44, 23, 39],
    'city' : ['Boston', 'Los Angeles', 'Michigan']
}
# DF
EmpDB_bottom = pd.DataFrame(EmployeeData_bottom, index=[11, 22, 33])
EmpDB_bottom

     ID     name  age         city
11  201  Charlie   44       Boston
22  202    Cathy   23  Los Angeles
33  203     Jack   39     Michigan

In [47]:
EmpDB_top

    ID       name  age          city
1  101     Daniel   34      New York
2  102  Christine   32  White Plains
3  103     Butler   40       Chicago

In [48]:
EmpDB_bottom

     ID     name  age         city
11  201  Charlie   44       Boston
22  202    Cathy   23  Los Angeles
33  203     Jack   39     Michigan

In [49]:
EmpDB_whole = pd.concat([EmpDB_top,EmpDB_bottom], ignore_index=True)
EmpDB_whole

    ID       name  age          city
0  101     Daniel   34      New York
1  102  Christine   32  White Plains
2  103     Butler   40       Chicago
3  201    Charlie   44        Boston
4  202      Cathy   23   Los Angeles
5  203       Jack   39      Michigan

In [50]:
EmpDB_whole = pd.concat([EmpDB_top,EmpDB_bottom]) #Default ignore_index=False
EmpDB_whole

     ID       name  age          city
1   101     Daniel   34      New York
2   102  Christine   32  White Plains
3   103     Butler   40       Chicago
11  201    Charlie   44        Boston
22  202      Cathy   23   Los Angeles
33  203       Jack   39      Michigan

In [51]:
# concat two DFs horizontaly
EmployeeData_left= {
    'ID' : [101, 102, 103], 
    'name' : ['Daniel', 'Christine', 'Butler'],
    'age' : [34, 32, 40],
    'city' : ['New York', 'White Plains', 'Chicago']
}

EmpDB_left = pd.DataFrame(EmployeeData_left, index=[1, 2, 3])
print(EmpDB_left)

EmployeeData_right= {
    'Salary' : [4000, 3000, 5000], 
}

EmpDB_right = pd.DataFrame(EmployeeData_right, index=[1, 2, 3])
print(EmpDB_right)

EmpDB_whole = pd.concat([EmpDB_left,EmpDB_right], axis = 1) # axis  0:vertical, 1:horizontal
EmpDB_whole

    ID       name  age          city
1  101     Daniel   34      New York
2  102  Christine   32  White Plains
3  103     Butler   40       Chicago
   Salary
1    4000
2    3000
3    5000

    ID       name  age          city  Salary
1  101     Daniel   34      New York    4000
2  102  Christine   32  White Plains    3000
3  103     Butler   40       Chicago    5000

In [52]:
# 데이터프레임 생성
data = {
    'ID': [101, 102, 103],
    'name': ['Daniel', 'Christine', 'Butler'],
    'age': [34, 32, 40],
    'city': ['New York', 'White Plains', 'Chicago'],
    'Salary': [4000, 3000, 5000]
}

df = pd.DataFrame(data)
print("원본 데이터프레임:")
print(df)

원본 데이터프레임:
    ID       name  age          city  Salary
0  101     Daniel   34      New York    4000
1  102  Christine   32  White Plains    3000
2  103     Butler   40       Chicago    5000

In [53]:
EmpDB_right

   Salary
1    4000
2    3000
3    5000

In [54]:
# 특정 행(Row) 제거
# (1) drop()을 사용하여 인덱스 기반으로 행 삭제
df1 = df.drop(index=1)  # 인덱스 1인 행 (Christine) 삭제
print("\n인덱스 1번 행 삭제:")
print(df1)

# (2) df[df['컬럼'] != 값] 방식으로 특정 값 가진 행 삭제
df2 = df[df['name'] != 'Daniel']  # 'Daniel'을 포함한 행 삭제
print("\n'name'이 Daniel인 행 삭제:")
print(df2)

인덱스 1번 행 삭제:
    ID    name  age      city  Salary
0  101  Daniel   34  New York    4000
2  103  Butler   40   Chicago    5000

'name'이 Daniel인 행 삭제:
    ID       name  age          city  Salary
1  102  Christine   32  White Plains    3000
2  103     Butler   40       Chicago    5000

In [55]:
# 특정 열(Column) 제거
# (1) drop()을 사용하여 컬럼 삭제
df3 = df.drop(columns=['city'])  # 'city' 컬럼 삭제
print("\n'city' 컬럼 삭제:")
print(df3)

# (2) del을 사용하여 컬럼 삭제
df4 = df.copy()
del df4['age']  # 'age' 컬럼 삭제
print("\n'age' 컬럼 삭제 (del 사용):")
print(df4)

'city' 컬럼 삭제:
    ID       name  age  Salary
0  101     Daniel   34    4000
1  102  Christine   32    3000
2  103     Butler   40    5000

'age' 컬럼 삭제 (del 사용):
    ID       name          city  Salary
0  101     Daniel      New York    4000
1  102  Christine  White Plains    3000
2  103     Butler       Chicago    5000

In [56]:
# 행과 열 동시에 제거
df5 = df.drop(index=2, columns=['Salary'])  # 인덱스 2 행 삭제 + 'Salary' 컬럼 삭제
print("\n인덱스 2 행과 'Salary' 컬럼 삭제:")
print(df5)

인덱스 2 행과 'Salary' 컬럼 삭제:
    ID       name  age          city
0  101     Daniel   34      New York
1  102  Christine   32  White Plains

In [ ]:
# End